Revit 2026 API

# Transform2DOrigin Property

---

The image of (0, 0) under OfPoint(UV). This defines the translational part of the transform.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public UV Origin { get; set; }
```
```vb
Public Property Origin As UV
	Get
	Set
```
```cpp
public:
property UV^ Origin {
	UV^ get ();
	void set (UV^ value);
}
```
```fsharp
member Origin : UV with get, set
```

#### Property Value

UV

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

Transform2D Class

Autodesk.Revit.DB Namespace